{
  "backend/main.mo": "Actor storing and mutating player state such as stress, flags, scene, and barricaded doors with query and update methods.",
  "feature_evidence.json": "Feature report mapping rendering and overlay fixes to specific frontend files with metadata and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑line summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme OKLCH color variables and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component wrapping GameView in a dark‑mode ThemeProvider.",
  "frontend/src/game/Audio/audioSettingsStore.ts": "Zustand store persisting audio volume and mute settings with setters.",
  "frontend/src/game/Audio/useTensionAudio.ts": "Hook generating a distance‑based tension hum using Web Audio, modulated by mouth reveal and volume settings.",
  "frontend/src/game/Dialogue/DialogueContext.tsx": "Context managing dialogue queue, visibility, timing, and processing helpers.",
  "frontend/src/game/Dialogue/scriptedLines.ts": "Simple object containing predefined enemy dialogue strings.",
  "frontend/src/game/Enemies/GreenHood/greenHoodAI.ts": "AI hook switching between idle, patrol, and chase based on player distance and triggering dialogue.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodEntity.tsx": "Enemy entity that moves toward AI targets, handles hood reveal state, and exposes imperative controls.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodModel.tsx": "3D model of the Green Hood with hoodie, glowing eyes, and teeth‑revealing mouth when triggered.",
  "frontend/src/game/Gameplay/hoodFallMechanic.ts": "Implements a hood-fall reaction event with timing, look detection using dot products, and stress penalty logic.",
  "frontend/src/game/GameView.tsx": "Main scene component configuring Canvas tone mapping and composing world, player controller, scene director, and HUD.",
  "frontend/src/game/Input/useInputMode.ts": "Chooses between touch and keyboard/mouse input modes and exposes movement, look, and interaction state.",
  "frontend/src/game/Input/useKeyboardMouse.ts": "Tracks keyboard movement, mouse look deltas, and interact key state with periodic updates.",
  "frontend/src/game/Input/useTouchLook.ts": "Generates look deltas from right‑side touch movement, accumulating and emitting them at intervals.",
  "frontend/src/game/Player/PlayerController.tsx": "Applies movement and camera rotation based on input and updates global player position each frame.",
  "frontend/src/game/Scenes/SceneDirector.tsx": "Triggers scripted dialogue events when entering specific scenes, starting with the intro sequence.",
  "frontend/src/game/State/usePlayerState.ts": "Manages player state synced with backend actor calls, including stress, scene, inventory, and save status.",
  "frontend/src/game/World/FacilityWorld.tsx": "Defines the 3D facility environment with lighting, cafeteria, corridor structures, and flickering effects.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context using Internet Identity, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Offers React Query hooks for fetching and mutating player state via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, global styles, color tokens, and horror-themed component utilities such as threat-text and jagged-border.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/ui/Controls/InteractButton.tsx": "Renders a mobile interact button that briefly triggers an interact input on touch.",
  "frontend/src/ui/Controls/InteractPrompt.tsx": "Displays a temporary interaction prompt placeholder if a prompt string is set.",
  "frontend/src/ui/Controls/MobileJoystick.tsx": "Implements a touch-controlled virtual joystick that emits normalized movement input.",
  "frontend/src/ui/Dialogue/DialogueBox.tsx": "Shows a jagged-frame dialogue box at the bottom of the screen using current dialogue context.",
  "frontend/src/ui/Hud/HudShell.tsx": "Composes HUD elements including overlays, dialogue, stress indicator, settings, and mobile controls.",
  "frontend/src/ui/Hud/StressIndicator.tsx": "Displays the player's stress value with a color-coded bar and numeric percentage.",
  "frontend/src/ui/Overlays/FadeToBlack.tsx": "Renders a timed fade-to-black overlay when activated.",
  "frontend/src/ui/Overlays/HoodVignetteOverlay.tsx": "Adds a hood-shaped vignette overlay with multiply blending.",
  "frontend/src/ui/Settings/SettingsPanel.tsx": "Provides a settings dialog with audio volume and mute controls.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, fonts, animations, and plugins.",
  "project_state.json": "Describes the project’s current state, features, issues, and design notes for a 3D horror game."
}