{
  "backend/main.mo": "Motoko actor storing player state and progression flags with methods to update stress, scene, items, save spots, and barricaded doors.",
  "feature_evidence.json": "Feature evidence report describing fixes for black 3D scene issue and listing relevant frontend files and components.",
  "frontend-file-summaries.txt": "Text file mapping numerous frontend paths to short summaries of their roles, mainly covering rendering, lighting, UI, controls, AI, and gameplay logic.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light/dark themes and applying base layout rules.",
  "frontend/index.html": "Base HTML document setting up root element and loading the main frontend script with fullscreen layout.",
  "frontend/src/App.tsx": "Wraps GameView in a dark-mode ThemeProvider with a full-size container.",
  "frontend/src/game/Audio/audioSettingsStore.ts": "Zustand store persisting global audio volume and mute settings with setters.",
  "frontend/src/game/Audio/useTensionAudio.ts": "Hook generating tension audio using Web Audio API and adjusting volume based on enemy proximity and mouth state.",
  "frontend/src/game/Dialogue/DialogueContext.tsx": "Dialogue provider managing a timed queue of dialogue lines with show/hide controls.",
  "frontend/src/game/Dialogue/scriptedLines.ts": "Exports predefined enemy dialogue lines used by AI and events.",
  "frontend/src/game/Enemies/GreenHood/greenHoodAI.ts": "AI hook determining idle, patrol, and chase states based on player distance and triggering threat dialogue.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodEntity.tsx": "Green Hood enemy entity handling model rendering, movement, orientation, and AI-driven target following.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodModel.tsx": "3D model of Green Hood with hood, glowing eyes, and mouth/teeth shown when revealed.",
  "frontend/src/game/Gameplay/hoodFallMechanic.ts": "Implements a timed event where looking at a target triggers stress penalty, including vector dot-product checks and a reaction window.",
  "frontend/src/game/GameView.tsx": "Main game container rendering the 3D scene with tuned tone mapping, FacilityWorld, player controller, scene logic, and HUD.",
  "frontend/src/game/Input/useInputMode.ts": "Chooses between touch and keyboard/mouse inputs, syncing movement, look, and interact states.",
  "frontend/src/game/Input/useKeyboardMouse.ts": "Tracks WASD movement, mouse look deltas, and interact key presses using event listeners and periodic updates.",
  "frontend/src/game/Input/useTouchLook.ts": "Computes look deltas from touch movement on the screen’s right side, accumulating movement and emitting updates periodically.",
  "frontend/src/game/Player/PlayerController.tsx": "Updates camera movement and orientation based on input and synchronizes player position with state each frame.",
  "frontend/src/game/Scenes/SceneDirector.tsx": "Triggers scripted dialogue events when entering scenes, such as an intro line after a delay.",
  "frontend/src/game/State/usePlayerState.ts": "Maintains player state synced with the backend actor and exposes update functions for stress, scene, items, and position.",
  "frontend/src/game/World/FacilityWorld.tsx": "Builds a 3D facility environment with lights, flicker effects, walls, and objects, including enemy placement.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout via a React context.",
  "frontend/src/hooks/useQueries.ts": "Wraps player-state queries and stress mutation calls using react-query with backend actor integration.",
  "frontend/src/index.css": "Defines global Tailwind layers, fonts, and custom color tokens for a horror-themed UI along with base layout and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, then renders the main App component.",
  "frontend/src/ui/Controls/InteractButton.tsx": "Touch-friendly interact button that triggers a brief interact input state using a themed image.",
  "frontend/src/ui/Controls/InteractPrompt.tsx": "Displays a temporary interaction prompt UI element when a prompt string is set.",
  "frontend/src/ui/Controls/MobileJoystick.tsx": "Implements a touch-based virtual joystick that tracks movement and sends normalized directional input.",
  "frontend/src/ui/Dialogue/DialogueBox.tsx": "Renders a jagged-frame bottom dialogue box showing the current line when dialogue is active.",
  "frontend/src/ui/Hud/HudShell.tsx": "Composes the full HUD including stress indicator, dialogue, overlays, mobile controls, and settings panel.",
  "frontend/src/ui/Hud/StressIndicator.tsx": "Shows the player's stress percentage with color-coded feedback using a progress bar.",
  "frontend/src/ui/Overlays/FadeToBlack.tsx": "Draws a timed fade‑to‑black overlay that animates opacity when activated.",
  "frontend/src/ui/Overlays/HoodVignetteOverlay.tsx": "Applies a dark vignette overlay resembling a hood effect across the screen.",
  "frontend/src/ui/Settings/SettingsPanel.tsx": "Settings dialog allowing volume adjustment and audio muting using shared audio state.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing the game’s goals, features, issues, and architectural notes."
}