{
  "backend/main.mo": "Motoko actor storing player state and providing update functions for stress, scene progression, save spots, and barricaded doors.",
  "feature_evidence.json": "Feature evidence record describing fullscreen GameView rendering with referenced files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables plus global rules ensuring full-height layout and dark theme support.",
  "frontend/index.html": "HTML entry point setting full-height body and root container with hidden overflow for fullscreen rendering.",
  "frontend/src/App.tsx": "Root React app wrapping GameView in a dark-mode ThemeProvider and full-size container.",
  "frontend/src/game/Audio/audioSettingsStore.ts": "Zustand store persisting audio volume and mute settings with setters.",
  "frontend/src/game/Audio/useTensionAudio.ts": "Hook generating a proximity-based tension hum using Web Audio oscillator and gain adjustments.",
  "frontend/src/game/Dialogue/DialogueContext.tsx": "Dialogue context managing queueing, timed display, visibility, and progression of dialogue lines.",
  "frontend/src/game/Dialogue/scriptedLines.ts": "Static map of predefined enemy dialogue lines.",
  "frontend/src/game/Enemies/GreenHood/greenHoodAI.ts": "AI hook determining idle, patrol, and chase states based on distance and triggering dialogue.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodEntity.tsx": "Green Hood enemy entity controlling movement, chase behavior, hood state, and orientation.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodModel.tsx": "3D model for the Green Hood with hood, glowing eyes, and revealed-mouth mode with teeth.",
  "frontend/src/game/Gameplay/hoodFallMechanic.ts": "Implements hood-fall detection logic using camera direction checks and timing, with a config-driven penalty system.",
  "frontend/src/game/GameView.tsx": "Main fullscreen Canvas scene combining world, player controller, scene director, and HUD within a DialogueProvider.",
  "frontend/src/game/Input/useInputMode.ts": "Selects touch or keyboard/mouse input and exposes movement, look, and interaction state.",
  "frontend/src/game/Input/useKeyboardMouse.ts": "Tracks WASD, mouse movement, and interact keys to produce movement and look deltas.",
  "frontend/src/game/Input/useTouchLook.ts": "Generates look deltas from right-side touch dragging with accumulated movement sampling.",
  "frontend/src/game/Player/PlayerController.tsx": "Applies movement and camera rotation based on input and updates the player's world position.",
  "frontend/src/game/Scenes/SceneDirector.tsx": "Triggers scripted dialogue lines based on scene progression, starting with an intro event.",
  "frontend/src/game/State/usePlayerState.ts": "Manages player state synced with backend actor and provides update helpers like stress or scene changes.",
  "frontend/src/game/World/FacilityWorld.tsx": "Defines lights, geometry, and environment setup for the facility world, including flickering effects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context, loading or creating identities via Internet Identity.",
  "frontend/src/hooks/useQueries.ts": "Exposes React Query hooks for fetching and mutating player state through the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, horror-themed color tokens, base resets, and custom components/utilities like threat text and jagged borders.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/ui/Controls/InteractButton.tsx": "Renders a mobile interact button that briefly triggers an interact input on touch.",
  "frontend/src/ui/Controls/InteractPrompt.tsx": "Placeholder component displaying an interaction prompt when provided.",
  "frontend/src/ui/Controls/MobileJoystick.tsx": "Implements a touch joystick that tracks movement via touch events and updates move input.",
  "frontend/src/ui/Dialogue/DialogueBox.tsx": "Displays the current dialogue line in a stylized jagged horror box at the bottom of the screen.",
  "frontend/src/ui/Hud/HudShell.tsx": "Composes the main HUD including dialogue, stress display, mobile controls, settings, and overlays.",
  "frontend/src/ui/Hud/StressIndicator.tsx": "Shows player stress percentage with a color‑coded bar based on stress level.",
  "frontend/src/ui/Overlays/FadeToBlack.tsx": "Provides a timed fade‑to‑black overlay that animates opacity when activated.",
  "frontend/src/ui/Overlays/HoodVignetteOverlay.tsx": "Renders a static hood‑style vignette overlay with multiply blend.",
  "frontend/src/ui/Settings/SettingsPanel.tsx": "Modal settings panel for audio volume and mute controls using shared audio settings.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, typography, plugins, and component animations.",
  "project_state.json": "Project metadata describing the game's theme, requirements, features, architecture, and known issues."
}