{
  "backend/main.mo": "Actor managing player stress, scene state, progression flags, save spots, and door barricade logic with getters and mutators.",
  "feature_evidence.json": "Feature evidence report mapping high-level game features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend game, UI, and system files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and dark‑mode industrial theme tokens for global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App root applying dark theme via ThemeProvider and rendering GameView.",
  "frontend/src/game/Audio/audioSettingsStore.ts": "Zustand store persisting audio volume and mute settings.",
  "frontend/src/game/Audio/useTensionAudio.ts": "Hook generating proximity‑based tension audio using Web Audio with distance and mouth‑reveal intensity scaling.",
  "frontend/src/game/Dialogue/DialogueContext.tsx": "Dialogue provider managing queued lines, visibility, and timed progression.",
  "frontend/src/game/Dialogue/scriptedLines.ts": "Static collection of predefined enemy threat lines.",
  "frontend/src/game/Enemies/GreenHood/greenHoodAI.ts": "Implements a React AI hook that sets GreenHood enemy states based on player distance and triggers dialogue during chase events.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodEntity.tsx": "Enemy entity handling position updates, hood state, chase speed, and AI‑driven movement.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodModel.tsx": "3D model of the Green Hood with body, hood, glowing eyes, and optional revealed mouth with teeth.",
  "frontend/src/game/Gameplay/hoodFallMechanic.ts": "Defines a hood‑fall reaction mechanic with look‑direction checks, timing, and stress penalties.",
  "frontend/src/game/GameView.tsx": "Sets up the main game view with canvas rendering, scene components, and UI wrapped in a dialogue provider.",
  "frontend/src/game/Input/useInputMode.ts": "Determines input mode (touch or keyboard/mouse) and routes movement, look, and interaction inputs accordingly.",
  "frontend/src/game/Input/useKeyboardMouse.ts": "Captures keyboard and mouse movement to produce movement vectors, look deltas, and interact state.",
  "frontend/src/game/Input/useTouchLook.ts": "Tracks touch movement on the screen’s right half to generate look deltas for touch devices.",
  "frontend/src/game/Player/PlayerController.tsx": "Updates camera movement and rotation from input and syncs the player’s position to global state each frame.",
  "frontend/src/game/Scenes/SceneDirector.tsx": "Handles scene-based scripted events, triggering intro dialogue after a delay.",
  "frontend/src/game/State/usePlayerState.ts": "Manages persistent player state via backend actor calls and exposes setters for stress, scene, items, and position.",
  "frontend/src/game/World/FacilityWorld.tsx": "Builds the 3D facility environment with lighting, rooms, interactable objects, and the GreenHood entity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, including loading, login, logout, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching player state and updating the player's stress value through the actor interface.",
  "frontend/src/index.css": "Sets global Tailwind and custom CSS variables, themes, and utility classes for the app's industrial‑horror visual style.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/ui/Controls/InteractButton.tsx": "Renders a touch‑friendly interact button that briefly triggers an interaction input.",
  "frontend/src/ui/Controls/InteractPrompt.tsx": "Displays an interaction prompt when available, currently using placeholder logic.",
  "frontend/src/ui/Controls/MobileJoystick.tsx": "Implements a touch joystick that tracks finger movement and updates movement input accordingly.",
  "frontend/src/ui/Dialogue/DialogueBox.tsx": "Shows stylized dialogue text at the bottom of the screen when a dialogue line is active.",
  "frontend/src/ui/Hud/HudShell.tsx": "Composes all HUD elements including stress indicator, mobile controls, prompts, overlays, and settings panel.",
  "frontend/src/ui/Hud/StressIndicator.tsx": "Displays the player's stress percentage with dynamic color coding and a progress bar.",
  "frontend/src/ui/Overlays/FadeToBlack.tsx": "Fades the screen to black over time when activated.",
  "frontend/src/ui/Overlays/HoodVignetteOverlay.tsx": "Renders a vignette overlay texture with blend effects for atmosphere.",
  "frontend/src/ui/Settings/SettingsPanel.tsx": "Shows a modal settings panel allowing control of audio volume and mute state.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH-based color system, extended typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a 3D first-person horror game with mobile controls, dialogue UI, core mechanics, required images, and existing feature definitions."
}