{
  "backend/main.mo": "Motoko actor managing player stress, scene state, progression flags, save spots, and barricaded doors with update/query methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components for lighting and UI behavior changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing gameplay, UI, lighting, AI, and input systems.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH theme variables for light/dark modes and base layout behavior.",
  "frontend/index.html": "Root HTML document setting up full-viewport layout and loading the React entrypoint.",
  "frontend/src/App.tsx": "App wrapper applying dark theme and rendering the GameView at full size.",
  "frontend/src/game/Audio/audioSettingsStore.ts": "Zustand store persisting audio volume and mute settings with simple setters.",
  "frontend/src/game/Audio/useTensionAudio.ts": "Hook generating positional tension audio via Web Audio, adjusting intensity by distance, volume, and mouth-reveal state.",
  "frontend/src/game/Dialogue/DialogueContext.tsx": "Dialogue context managing a timed queue of lines, visibility state, and sequencing logic for UI dialogue.",
  "frontend/src/game/Dialogue/scriptedLines.ts": "Static collection of short enemy threat lines used by dialogue triggers.",
  "frontend/src/game/Enemies/GreenHood/greenHoodAI.ts": "AI hook controlling idle, patrol, and chase states using player distance and triggering dialogue threats.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodEntity.tsx": "Green Hood enemy entity handling model rendering, movement, AI integration, and imperative controls for hood and speed.",
  "frontend/src/game/Enemies/GreenHood/GreenHoodModel.tsx": "3D model of the Green Hood with hood, glowing eyes, and an optional revealed mouth with teeth.",
  "frontend/src/game/Gameplay/hoodFallMechanic.ts": "Implements a timing-based hood fall event with look detection and stress penalties using vector math.",
  "frontend/src/game/GameView.tsx": "Sets up the main game view with React Three Fiber, loading the world, player controller, scene director, and HUD inside a DialogueProvider.",
  "frontend/src/game/Input/useInputMode.ts": "Detects touch vs keyboard/mouse and routes movement, look, and interaction inputs accordingly.",
  "frontend/src/game/Input/useKeyboardMouse.ts": "Tracks WASD movement, mouse look deltas, and interact key presses via event listeners and an update interval.",
  "frontend/src/game/Input/useTouchLook.ts": "Calculates look deltas from touch movement on the right half of the screen with periodic updates.",
  "frontend/src/game/Player/PlayerController.tsx": "Applies movement and camera rotation based on input, updates player position, and keeps camera at head height.",
  "frontend/src/game/Scenes/SceneDirector.tsx": "Triggers scripted dialogue events based on the current scene, including a timed intro line.",
  "frontend/src/game/State/usePlayerState.ts": "Loads and manages player state from the backend actor with helpers for updating stress, scene, items, and save status.",
  "frontend/src/game/World/FacilityWorld.tsx": "Defines lighting and basic cafeteria/corridor geometry, including a flickering light and spawning the GreenHood enemy.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state and helpers using AuthClient, exposing identity and login actions via context.",
  "frontend/src/hooks/useQueries.ts": "Wraps player state fetching and stress updates with React Query, tied to the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, color tokens, horror-themed styles, and utility classes for the app’s visual theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/ui/Controls/InteractButton.tsx": "Renders a touch-friendly interact button that triggers a short interact input pulse.",
  "frontend/src/ui/Controls/InteractPrompt.tsx": "Displays a temporary interact prompt message when available.",
  "frontend/src/ui/Controls/MobileJoystick.tsx": "Implements a touch-based virtual joystick that outputs normalized movement input.",
  "frontend/src/ui/Dialogue/DialogueBox.tsx": "Shows a stylized bottom-screen dialogue line when the dialogue system is active.",
  "frontend/src/ui/Hud/HudShell.tsx": "Assembles HUD elements including vignette, stress bar, mobile controls, prompts, dialogue, fade overlay, and settings panel.",
  "frontend/src/ui/Hud/StressIndicator.tsx": "Displays player stress value with color-coded percentage and progress bar.",
  "frontend/src/ui/Overlays/FadeToBlack.tsx": "Fades the screen to black over time when activated.",
  "frontend/src/ui/Overlays/HoodVignetteOverlay.tsx": "Applies a hood-shaped vignette overlay for atmospheric framing.",
  "frontend/src/ui/Settings/SettingsPanel.tsx": "Modal panel providing audio settings including volume and mute controls.",
  "frontend/tailwind.config.js": "Configures Tailwind theme with custom color tokens, fonts, animations, and plugins.",
  "project_state.json": "Describes project state, features, issues, and design notes for the horror game build."
}