{
  "kind": "build_request",
  "title": "Retry: Replace facility lighting system with dark-but-visible global preset",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Replace the current facility lighting setup with a new global dark-but-visible lighting preset that applies across the entire facility, ensuring all core environment geometry (floors, walls, props) is readable everywhere while keeping an industrial horror mood (dark, but not pitch black).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "retry the build exactly as before."
        ]
      },
      "acceptanceCriteria": [
        "In all facility areas (corridor and cafeteria), the player can clearly see walls, floors, and major props without relying on the HUD or overlays.",
        "The overall scene remains dark and tense (not brightly lit), but no large areas of the environment render as pure black during normal gameplay.",
        "Lighting changes are implemented primarily in `frontend/src/game/World/FacilityWorld.tsx` and are applied consistently across the whole map (not just one room)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update renderer exposure/tone-mapping/background settings as needed so the new lighting preset renders consistently and does not crush blacks, while maintaining the intended dark industrial look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "retry the build exactly as before."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/game/GameView.tsx` produces a stable dark-but-visible image on initial load (no fully black frame after scene mounts).",
        "Tone mapping/exposure settings do not wash out emissive elements (e.g., keycard emissive) and do not overbrighten the entire scene.",
        "The scene background remains dark and cohesive with the facility mood (no bright/white clear color)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Verify that UI overlays do not interfere with the goal of a dark-but-visible 3D environment by ensuring the hood vignette remains subtle and FadeToBlack is inactive unless explicitly triggered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "retry the build exactly as before."
        ]
      },
      "acceptanceCriteria": [
        "During normal gameplay, the hood vignette overlay does not reduce visibility enough to make the 3D environment appear black.",
        "FadeToBlack does not render or affect the screen unless explicitly activated via its `active` prop.",
        "Visibility improvements are achieved via 3D environment lighting/exposure rather than by removing the horror vignette entirely."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (Shadcn components are read-only and must be composed, not modified).",
    "Do not modify immutable frontend hook paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Backend must remain a single Motoko actor; no backend changes are required for this lighting-only retry.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new gameplay mechanics, enemies, scenes, or puzzles as part of this lighting retry.",
    "Do not change narrative/dialogue content.",
    "Do not introduce new asset pipelines or backend image serving."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}