{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Render the 3D GameView fullscreen without scrollbars",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Ensure the React Three Fiber GameView fills the viewport on all devices by fixing root element height rules and making the Canvas container occupy the full visible viewport without introducing scrollbars, while preserving HUD overlay positioning.",
      "acceptanceCriteria": [
        "On desktop and mobile, the 3D scene fills the entire visible viewport (no letterboxing caused by container sizing).",
        "No page scrollbars appear during normal gameplay due to layout sizing (unless intentionally added elsewhere).",
        "HUD overlays (stress indicator, settings button, dialogue box, mobile controls) remain positioned correctly on top of the fullscreen canvas."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Update the GameView outer container styling so it reliably occupies the full viewport (e.g., viewport-height aware sizing and overflow hidden) and remains the positioning context for HUD overlays; ensure the Canvas inherits full-size dimensions from its parent without introducing layout-driven letterboxing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global layout CSS to ensure html, body, and #root consistently allow 100% height and prevent scrollbars (including mobile dynamic viewport considerations), avoiding width rules (e.g., 100vw) that can cause horizontal overflow; keep existing theme tokens and non-goal rendering settings unchanged."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Ensure the document root elements support full-height rendering for the React mount (e.g., add appropriate attributes/classes or minimal structure changes) so the GameView can fill the viewport without scrollbars."
        }
      ]
    }
  ]
}