{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore visibility of 3D facility scene while preserving dark horror mood",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Fix black-screen rendering by calibrating renderer exposure/tone-mapping, ensuring world lighting/materials read correctly, and preventing HUD overlays from obscuring the scene unless explicitly triggered.",
      "acceptanceCriteria": [
        "On first load, the facility geometry (floors/walls/props) is visibly rendered (not a fully black screen) on both desktop and mobile-sized viewports.",
        "The hood vignette overlay remains subtle and does not make the scene appear black during normal play.",
        "The fade-to-black overlay is not active by default and only appears when explicitly triggered; when inactive it does not render or affect scene visibility.",
        "Changes do not introduce scrollbars and the Canvas remains fullscreen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Verify and adjust renderer configuration to avoid underexposure (tone-mapping + exposure) while keeping a dark industrial-horror look; ensure color space/output settings are correct and consider setting renderer defaults via Canvas onCreated (e.g., physically-correct lighting / color management) so the scene is not rendered fully black on load."
        },
        {
          "path": "frontend/src/game/World/FacilityWorld.tsx",
          "operation": "modify",
          "description": "Verify lighting and material visibility: ensure there is sufficient baseline fill light (ambient/hemisphere) and key lights (directional/point) to reveal geometry without flattening the mood; validate shadow settings and material parameters (roughness/metalness/emissive) so surfaces don’t read as pure black under the chosen tone mapping."
        },
        {
          "path": "frontend/src/ui/Overlays/HoodVignetteOverlay.tsx",
          "operation": "modify",
          "description": "Reduce/retune the vignette’s visual impact so it remains subtle during normal gameplay (e.g., lower opacity and/or adjust blend mode/implementation) and cannot make the full scene appear black by default; ensure it stays as an overlay and does not affect Canvas sizing or introduce scrollbars."
        },
        {
          "path": "frontend/src/ui/Overlays/FadeToBlack.tsx",
          "operation": "modify",
          "description": "Ensure the fade overlay has no effect unless explicitly activated: confirm it returns null when inactive (no DOM layer/opacity effect), and validate any default styling (z-index/background/opacity) cannot inadvertently obscure the scene on initial load."
        },
        {
          "path": "frontend/src/ui/Hud/HudShell.tsx",
          "operation": "modify",
          "description": "Verify overlay wiring so neither hood vignette nor fade-to-black obscures the scene during normal play: confirm fade-to-black is not triggered by default, and ensure overlay stacking/z-index keeps HUD readable without turning the entire view black."
        }
      ]
    }
  ]
}